---
kind: method
id: M:Autodesk.Revit.DB.RenderingImageExposureSettings.Dispose
source: html/3875c981-21f9-e458-7083-fc8638d1a964.htm
---
# Autodesk.Revit.DB.RenderingImageExposureSettings.Dispose Method

Releases all resources used by the RenderingImageExposureSettings

## Syntax (C#)
```csharp
public void Dispose()
```